{
  "title": "Jaimes Projekte",
  "projIntro": "Diese Seite listet eine Reihe von Projekten auf, an denen ich kürzlich beteiligt war. Ich habe sie in drei Abschnitte unterteilt...",
  "section1": {
    "title": "Portfolio-Projekte für meine Code-Institute-Full-Stack-Zertifizierung",
    "description": "Diese Projekte habe ich ursprünglich im Rahmen meines Full-Stack-Programmierkurses selbstständig erstellt.",
    "projects": {
      "farming": {
        "name": "Farming Futures",
        "siteURL": "https://jaimehyland.github.io/farming-futures/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/farming-futures",
        "desc": "Robotik in der Landwirtschaft. Eine einfache, responsive statische Seite (Deployment über GitHub)."
      },
      "acento": {
        "name": "El acento español",
        "siteURL": "https://jaimehyland.github.io/elAcentoEspanyol/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/farming-futures",
        "desc": "Erklärseite zur spanischen Tilde. Verwendung einer einfachen, JSON-basierten Datenstruktur mit Logik in JS (Deployment über GitHub)."
      },
      "witch": {
        "name": "Witch-Hazel",
        "siteURL": "https://witch-hazel-5f8d8dfa45da.herokuapp.com/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/elAcentoEspanyol",
        "desc": "CLI-App zur Veredelungsverwaltung in einer Baumschule. Enthält komplexere Logik auf einem Google Spreadsheet mittels Python (Deployment über Heroku)."
      },
      "family": {
        "name": "Familieneinkaufsliste",
        "siteURL": "https://family-shopping-list-v1-bafe564ca613.herokuapp.com/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/family_shopping_list_v1",
        "desc": "Multiuser-Einkaufs-App mit Django/PostgreSQL, Instant Messaging über Daphne und Django Channels in Kombination mit Redis (Deployment über Heroku)."
      },
      "mellifera": {
        "name": "Mellifera",
        "siteURL": "https://mellifera-e383ea0670a3.herokuapp.com/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/mellifera",
        "desc": "Ein (fast) funktionsfähiger Online-Shop für Imker mit Stripe-Zahlungen, Deployment über Heroku und AWS für statische Dateien."
      }
    }
  },
  "section2": {
    "title": "Laufende unabhängige Projekte",
    "description": "Diese Projekte wurden auf eigene Initiative unabhängig erstellt und befinden sich noch in der Entwicklung.",
    "projects": {
      "portfolio": {
        "name": "Jaime Hylands Portfolio",
        "siteURL": "https://jaime-hyland.com/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/jaime-hyland-portfolio",
        "desc": "Diese Website ist das dreisprachige Portfolio, das Sie gerade ansehen – ein persönliches Projekt, das ich eigenständig mit Next.js entwickelt habe."
      },
      "language": {
        "name": "language-landscapes.com",
        "siteURL": "https://language-landscapes.com",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/language-landscapes",
        "desc1": "Dies ist ein älteres CakePHP-Projekt, das ursprünglich von einer externen Fachkraft nach meinen Vorgaben entwickelt wurde. Ich verwalte es inzwischen selbst – inklusive mehrmaliger Reparaturen. Eine spätere Migration auf ein modernes Framework ist geplant. Aktuell ist die Seite nicht responsive.",
        "desc2": "Derzeit liegt das Hosting bei GoDaddy, aber aufgrund von Kosten und Servicequalität plane ich, es im Zuge der Neustrukturierung zu einem anderen Anbieter zu verlagern."
      },
      "pdf-merger": {
        "name": "Local PDF Merger",
        "siteURL": "https://pdf-merge-app-five.vercel.app/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/pdf_merge_app/",
        "desc1": "Dieses Projekt befindet sich noch in einem sehr frühen Stadium. Derzeit handelt es sich lediglich um ein minimales Next.js-Gerüst für eine Routine, die auf pdf-lib basiert (pdf-lib ist eine TypeScript-Bibliothek mit nützlichen Komponenten zum Umgang mit PDF-Dateien). Auch wenn die App noch einfach ist, funktioniert sie. Du kannst sie gerne ausprobieren (verwende die Umschalt- oder Steuerungstaste, um mehr als eine PDF-Datei mittlerer Größe auszuwählen). Inspiriert durch einige gemischte Erfahrungen beim Versuch, PDF-Dateien für meine Jobsuche zusammenzuführen, und durch das ausgeprägte Interesse vieler deutscher Verbraucher am Datenschutz, habe ich mich dazu entschlossen, eine App zu entwickeln, die PDF-Dateien zusammenführt, ohne dass Nutzer ihre privaten Dateien hochladen oder die zusammengeführte Datei herunterladen müssen.",
        "desc2": "Die App wird sich mit der Zeit weiterentwickeln. Du kannst meinen Fortschritt hier mitverfolgen."
      },
      "shopify-prototype": {
        "name": "Shopify-Prototyp",
        "siteURL": "https://language-landscapes.myshopify.com/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/shop-prototype/",
        "desc1": "Dieses Projekt befindet sich ebenfalls noch in einem sehr frühen Stadium. Bisher habe ich Folgendes geschafft:",
        "items": [
          "Ein erstes Shopify-App-Gerüst mit Node.js/Next.js erstellt – mithilfe der Shopify-CLI",
          "Einen einfachen Shop erstellt und mit der App verbunden",
          "Die Datei shopify.app.toml konfiguriert, um der App eine Identität zu geben und die Verbindung zum Shop herzustellen",
          "Die lokale Entwicklungsumgebung mit einem Cloudflare-Tunnel eingerichtet",
          "Die App mit einem GitHub-Repository für Versionskontrolle und Zusammenarbeit verbunden"
          ],
        "desc2": "Das Projekt wird sich mit der Zeit weiterentwickeln. Du kannst meinen Fortschritt hier verfolgen – oder hin und wieder meinen Shop und das Repository besuchen."
      }
    }
  },
  "section3": {
    "title": "Hackathon-Projekte",
    "description1": "Diese kollaborativen Projekte wurden im Rahmen verschiedener Hackathons des Code Institute ab Ende 2024 entwickelt. Die Teams bestanden jeweils aus sechs bis sieben Personen, die innerhalb von fünf Tagen (mit einer Ausnahme drei) ein vollständiges Full-Stack-Projekt entwarfen, entwickelten und dokumentierten. Da ich sie nur gelegentlich warte, kann ich die dauerhafte Funktionsfähigkeit nicht garantieren.",
    "description2": "Da ich in jeder Hackathon-Woche mehr gelernt habe als oft in einem ganzen Studienmonat, möchte ich weiterhin an Hackathons teilnehmen – laufende Ergänzungen dieser Liste sind also zu erwarten!",
    "CIHackathonsURL": "https://hackathon.codeinstitute.net/",
    "projects": {
      "techbuddy": {
        "name": "TechBuddy",
        "hackathonName": "Branching Out: A family hackathon",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/60/",
        "siteURL": "",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/apeskinian/tech_buddy",
        "desc": "Technische Hilfs-App für die ganze Familie. Innerhalb von nur drei Tagen im Team von sechs Personen entwickelt – am letzten Tag vor Ort. TeamBuddy gewann den 2. Preis beim CI-Hackathon im Mai.",
        "role": "Meine Rolle: Konzeption der ursprünglichen Login-Logik; Feinabstimmung des KI-Chats; Design und Codierung der Chat-Struktur."
      },
      "shegitsit": {
        "name": "SheGitsIt",
        "hackathonName": "CodeHER: Empowering Women in Tech",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/58/",
        "siteURL": "",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/Carlos-n21/Team-4-SheCanGitIt",
        "desc": "Eine App zur Unterstützung von Frauen in der Tech-Branche, u. a. mit einem Instant-Messaging-Service zur Kommunikation mit Mentorinnen. Das Projekt gewann den 3. Platz beim CI-Hackathon im März.",
        "role": "Meine Rolle: Konzeption und Umsetzung der Messaging-Logik sowie das Setup für das Django-Channels-Deployment."
      },
      "sparksync": {
        "name": "SparkSync",
        "hackathonName": "Love.exe – Coding connections in the digital age",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/56/",
        "siteURL": "",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/violaberg/dating-app",
        "technologies": "Django, Python, HTML5, CSS3, JavaScript, Heroku, Neon, Resend, Bootstrap, Django Channels, Daphne, Redis",
        "desc": "Eine Dating-App mit Instant Messaging, die vom Code Institute als Showcase-Projekt ausgezeichnet wurde. Sie gewann außerdem den 2. Preis im Februar-Hackathon.",
        "role": "Meine Rolle: Design und Implementierung der Messaging-Logik sowie Setup des Django-Channels-Deployments mit Redis."
      },
      "co2nscious": {
        "name": "CO₂nscious",
        "hackathonName": "Battle of the Bootcamps",
        "hackathonDesc": "Ein besonders kurzer Hackathon (drei statt fünf Tage), organisiert vom Code Institute gemeinsam mit zwei Berliner IT-Ausbildungsinstitutionen und gesponsert von Doc Morris.",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/52/",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/raneem-yad/CO-nsious",
        "desc": "App zur Förderung klimafreundlichen Handelns – aufgrund der Kürze des Hackathons konnte kein funktionsfähiger Prototyp fertiggestellt werden.",
        "role": "Meine Rolle: Wireframes, Django-Modelle und Swagger-APIs. Ich habe in kurzer Zeit viel über die Trennung von Frontend- und Backend-Logik sowie über kollaboratives Arbeiten mit Git gelernt."
      }
    }
  },
  "section4": {
    "title": "Wichtige berufliche Erfolge",
    "projects": {
      "microbus-l10n": {
        "name": "Lokalisierung für Microbus (IVU-Suite)",
        "desc1": "Als ich 2004 bei <bold>IVU Traffic Technologies</bold> anfing, übernahm ich die Verantwortung für die Lokalisierung (l10n) einer großen und organisch gewachsenen Softwaresuite für Planung, Disposition und Abrechnung im öffentlichen Verkehr. Diese Suite war über viele Jahre in C, C++, Java und weiteren Sprachen entstanden, alle mit einer zentralen <bold>Oracle</bold>-Datenbank verbunden, und erforderte eine kontinuierliche Lokalisierung der Benutzeroberflächen und Dokumentation in 14 Sprachen und Dialekten.",
        "desc2": "Das l10n-Umfeld stellte damals einige wichtige Herausforderungen dar:",
        "desc3": "Gemeinsam mit meinen Kolleg:innen und auch eigenständig begegnete ich diesen und weiteren Herausforderungen durch Prozessoptimierung, Tool-Integration und Softwareentwicklung:",
        "problems": [
          "Mehrere UI-Ressourcenformate und -orte (Java-Resource-Dateien, JSON, XML, Excel, Datenbankeinträge, Windows-MFC-Dialoge)",
          "Widersprüchliche und inkonsistente Terminologie aus Altsystemen",
          "Herkunft von UI-Texten im Code oft schwer nachvollziehbar",
          "Großes, arbeitsintensives HTML-Hilfesystem (generiert aus MS Word mit Doc2Help)",
          "Zahlreiche lokalisierte Produktvarianten mit unterschiedlichen Sprachkombinationen",
          "Inkonsistente Internationalisierung (i18n) im Code (harte Formatierungen, unklare Verkettungen)",
          "Jeder neue Build erforderte neue manuelle Lokalisierungsrunden",
          "Uneinheitliche Nutzung von Translation-Memory- und Terminologiewerkzeugen",
          "Lokale-spezifische Formate (Währung, Datum, Zeit) oft falsch gehandhabt",
          "Schlechte oder fehlende Lokale-spezifische Formatierung"
        ],
        "solutions": [
          "Einführung und Durchsetzung von Terminologieverwaltung mit <bold>Termstar</bold> und eigenen Tools",
          "Konsolidierung und Standardisierung des deutschen Glossars",
          "Ablösung des Doc2Help-Workflows durch <bold>Author-it</bold> mit Single-Source-Prinzip",
          "Ermöglichung kundenspezifischer Dokumentation je nach Sprache und Kunde – deutlich weniger „Versionierungschaos“",
          "UI-Übersetzung mit <bold>Passolo</bold> und <bold>Transit</bold> optimiert – gleiche Texte nur einmal übersetzen",
          "Transit-Übersetzungsspeicher in Doku-Generierung und l10n-Prozesse integriert",
          "Automatische Softwareübersetzung in nächtlichen Build integriert (<bold>Maven/Ant</bold> + Passolo)",
          "Mit Entwickler:innen zusammengearbeitet, um i18n-Best-Practices zu verbessern und durchzusetzen",
          "Systeme entwickelt, um Terminologie-Inkonsistenzen und schlechte i18n im Code zu erkennen und zu beheben",
          "UI-Größenanpassung mit <bold>MFC</bold> und <bold>Java Swing</bold> unter Einsatz von Passolo umgesetzt"
        ]
      }
    }
  },
  "badges": {
    "may2025_2nd": "Zweiter Platz – Hackathon, Mai 2025",
    "march2025_3rd": "Dritter Platz – Hackathon, März 2025 ",
    "march2025_people": "'People's Choice' – Hackathon, März 2025",
    "feb2025_2nd": "Zweiter Platz – Hackathon, Februar 2025 "
  }
}
