{
  "pageInline": {
    "title": "Jaime's Projects",
    "name": "Jaime Hyland",
    "tagline": "Full-stack developer – Projects completed and WIP",
    "description": "Detailed list of Jaime Hyland’s on-going and completed web & mobile development projects.",
    "keywords": [
      "Jaime Hyland",
      "Full-stack developer",
      "Portfolio projects",
      "Code Institute",
      "Hackathon projects",
      "Python",
      "Django",
      "TypeScript",
      "Next.js",
      "React",
      "Flutter",
      "Tailwind CSS",
      "PostgreSQL",
      "Redis",
      "Heroku",
      "GitHub",
      "AWS",
      "Stripe",
      "Shopify",
      "Node.js",
      "JavaScript",
      "HTML5",
      "CSS3",
      "Bootstrap",
      "i18n",
      "l10n",
      "Server-side rendering",
      "Responsive design",
      "SEO",
      "Software deployment",
      "Database management",
      "CLI apps",
      "PDF handling",
      "Agile development",
      "Collaborative projects",
      "AI integration",
      "E-commerce apps",
      "Shopping list app",
      "Language learning app",
      "Robotics app",
      "Grafting manager app",
      "Climate-friendly app",
      "Dating app",
      "Technical documentation",
      "Mobile app templates",
      "Software localization",
      "Cross-language support",
      "Full-stack portfolio"
    ]

  },
  "title": "Jaime's Projects",
  "projIntro": "This page lists a number of the projects I have been involved in recently. I have divided it into four sections...",
  "section1": {
    "title": "Portfolio Projects for my Code Institute full-stack qualification",
    "description": "These projects were originally created by me alone as part of my full-stack programming course.",
    "projects": {
      "farming": {
        "name": "Farming Futures",
        "siteURL": "https://jaimehyland.github.io/farming-futures/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/farming-futures",
        "desc": "Robotics in agriculture. This is a fairly simple, responsive static site (with deployment in GitHub)"
      },
      "acento": {
        "name": "El acento español",
        "siteURL": "https://jaimehyland.github.io/elAcentoEspanyol/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/elAcentoEspanyol",
        "desc": "Spanish tilde explainer. It shows the use of a simple, json-based data file and contains some simple logic written in JS (deployment in Github)"
      },
      "witch": {
        "name": "Witch-Hazel",
        "siteURL": "https://witch-hazel-5f8d8dfa45da.herokuapp.com/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/elAcentoEspanyol",
        "desc": "Grafting manager CLI app. A specialized app to manage a grafting process at a plant nursery. Contains some relatively intricate logic on a Google spreadsheet using Python (deployment using Heroku)"
      },
      "family": {
        "name": "Family Shopping List",
        "siteURL": "https://family-shopping-list-v1-bafe564ca613.herokuapp.com/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/family_shopping_list_v1",
        "desc": "A Django/PostgreSQL multi-user shopping app with instant messaging using Daphne and Django Channels in combination with Redis (deployment using Heroku)"
      },
      "mellifera": {
        "name": "Mellifera",
        "siteURL": "https://mellifera-e383ea0670a3.herokuapp.com/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/mellifera",
        "desc": "An (almost) working online shop for beekeepers using Stripe for payments, deployed on Heroku, and using AWS to deal with static files"
      }
    }
  },
  "section2": {
    "title": "Ongoing independent Projects",
    "description": "These projects were created independently on my own initiative; they should all be considered Work in Progress",
    "projects": {
      "projectodo": {
        "name": "Projectodo",
        "siteURL": "https://projectodo.vercel.app/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/projectodo",
        "desc1": "I'm now building this site as a commercial project for a client who provides a variety of musical services, from music lessons, through technical and sound support for concerts, all the way to live musical events. The site's front end (especially its internationalization and graphic features) is developed in next.js using React, intl-next and Tailwind, while its backend will be based on a PostreSQL database.  The APIs it needs will be provided by Django, as will its authentication features (both at front and back end). ",
        "desc2": "The site will feature:",
        "features": [
          "An easy that allows the user to add, edit and remove custom pages (for example, for musical groups, sound technicians, etc.",
          "A variety of different user categories, from admin through musician member, to unregistered user (the precise categories and their permissions will be defined in early February",
          "Unintrusive, polished <bold>i18n</bold> support, with l10n in English, German and Spanish",
          "Clean, accessible design",
          "Fully responsive UI for desktop, laptop, tablet and smartphone",
          "Automatic generation of meta nodes all pages for SEO; a sitemap and robots.txt",
          "Impressum (Legal disclosure), also fully localized",
          "Note the correct localization of UI URLs.",
          "Integrated Vercel analytics, with banner consent form and data privacy management modal"
        ],
        "desc3": "As with all my web design work, I am emphasizing fuss-free clarity, maintainability, responsiveness, cross-language consistency and legal conformity. It will use typed <bold>React</bold> components with <bold>server-side rendering</bold> wherever possible and will reflect the same standards I bring to all my individual and collaborative work. It'll be fully responsive and SEO-friendly, and demonstrate my ability to deliver robust, scalable content platforms with modern frontend and backend technologies.",
        "desc4": "I am currently working intensively on the site. I am implementing many of the lessons I learned while developing my portfolio site (see below). I also intend to apply the lessons I'm learning from the projectodo site in my refactoring efforts with my online portfolio."
      },
      "portfolio": {
        "name": "Jaime Hyland's Portfolio",
        "siteURL": "https://jaime-hyland.com/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/jaime-hyland-portfolio",
        "desc1": "This project is the site you're looking at now. It's a professional, multilingual portfolio built in <bold>TypeScript</bold> using <bold>Next.js</bold>, <bold>Tailwind CSS</bold>, and <bold>next-intl</bold>, designed to showcase my background in software localization, technical writing, and software development.",
        "desc2": "The site features:",
        "features": [
          "A structured, interactive CV",
          "A detailed portfolio of my projects, with an emphasis on the new",
          "Unintrusive, polished <bold>i18n</bold> support, with l10n in English, German and Spanish",
          "Clean, accessible design",
          "Fully responsive",
          "Automatic generation of meta nodes on homepage for SEO; a sitemap and robots.txt",
          "Impressum (Legal disclosure), also fully localized",
          "Note the correct localization of UI URLs. Due to next.js' limitations, this required a hybrid client-server-side solution combining redirects, server-rendering and client-side final adjustment. All URLs, including for internal anchor-based links, are now fully localized.",
          "Integrated Vercel analytics, with banner consent form and data privacy management modal"
        ],
        "desc3": "In building it, I've emphasized fuss-free clarity, maintainability, responsiveness, cross-language consistency and legal conformity. It uses typed <bold>React</bold> components with <bold>server-side rendering</bold> and reflects the same standards I bring to my individual and collaborative work. It's fully responsive, SEO-friendly, and demonstrates my ability to deliver robust, scalable content platforms with modern frontend tooling.",
        "desc4": "The site is, however, very much a work-in-progress. Now that the basic structure of the project is in place, there are two obvious next steps:",
        "nextSteps": [
          "Move language resources to a DB as first step to creating a simple, multilingual single-source publishing system, so that changes in text affect Word/OpenOffice documents, PDFs and the website simultaneously at source",
          "Begin a refactoring effort to make it easier to reuse code, with the possible eventual goal of providing a simple personal online portfolio-maker for other users"
        ]
      },
      "djangoFlutterI18n": {
        "name": "Django-Flutter i18n template",
        "codebaseText": "GitHub-Repository",
        "codebaseURL": "https://github.com/JaimeHyland/django-flutter-i18n-template",
        "desc1": "This ongoing project is designed to provide a template for developing mobile apps using Flutter on the frontend, with Django at the back. It integrates Flutter's i18n system, making full use of ISO codes for locales consisting of language_country codes. It is equivalent to what a Wikipedia contributor would call a stub, but I can assure you it has quite a lot more under the hood than can be seen from the UI.",
        "desc2": "It will form the basis of two projects I intend to begin work by the middle of November: a heavily AI-supported mobile app for learning language grammar and a multilingual mobile app version of one of the projects I created as a web app for my Code Institute certificate; 'Family Shopping List' (see above)."
      },
      "language": {
        "name": "language-landscapes.com",
        "siteURL": "https://language-landscapes.com",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/language-landscapes",
        "desc1": "This is a legacy CakePHP project. It was originally designed and developed more than a decade ago by a skilled third party following my instructions. I now manage it. I have broken and fixed it again several times. At some stage in the future I intend to refactor it to a more modern framework, but at the moment it is not responsive.",
        "desc2": "It is currently hosted by GoDaddy, but for reasons of price and customer service, I intend to move it to another provider as part of my wider refactoring effort."
      },
      "pdf-merger": {
        "name": "Local PDF Merger",
        "siteURL": "https://pdf-merge-app-five.vercel.app/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/pdf_merge_app/",
        "desc1": "This project is in its very early stages. At present it's simply a minimal Next.js harness for a pdf-lib routine (pdf-lib itself being a typescript library containing useful components for handling pdf files). While primitive, the app works. You can try it out if you like (use the shift or control key to choose more than one modestly sized pdf file). Inspired by some mixed experiences I have recently had trying to merge pdf files for my job search effort and by the strong interest in privacy of German consumers in particular, I've decided to attempt to build an app that merges pdf files without requiring the user to upload their private files and then download the final merged file.",
        "desc2": "It will develop over time. You can follow my progress by watching this space."
      },
      "shopify-prototype": {
        "name": "Shopify prototype",
        "siteURL": "https://language-landscapes.myshopify.com/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/JaimeHyland/shop-prototype/",
        "desc1": "This project is in its very early stages too. So far, I've managed to do the following:",
        "items": [
          "Created an initial Shopify app scaffold with Node.js/Next.js, using the Shopify CLI",
          "Created a bare-bones shop and connected it up to the app",
          "Configured the app's shopify.app.toml to give an identity to the app identity and create the link to the store",
          "Ready to run the local dev environment using a Cloudflare tunnel",
          "Connected the app to a GitHub repository for version control and collaboration"
        ],
        "desc2": "It will develop further over time. You can follow my progress by watching this space, and perhaps visiting my shop and my repository every now and then."
      }
    }
  },
  "section3": {
    "title": "Hackathon Projects",
    "description1": "These collaborative projects were developed as part of various hackathons organized by Code Institute from late 2024 on. Each hackathon involved a team of six or seven people designing, developing and documenting a full-stack project on a particular theme – with one exception, over five days. While I look in on them from time to time to check on them, I can't guarantee that they will always be in working condition.",
    "description2": "As I feel I probably learnt more in each week that I completed a hackathon than I would often learn in an entire month of study, I intend to continue doing hackathons whenever I get the chance. So stand by for ongoing additions to this list!",
    "CIHackathonsURL": "https://hackathon.codeinstitute.net/",
    "projects": {
      "techbuddy": {
        "name": "TechBuddy",
        "hackathonName": "Branching Out: A family hackathon",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/60/",
        "siteURL": "https://support-squad-tech-buddy-9d4a4ad47301.herokuapp.com/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/apeskinian/tech_buddy",
        "desc": "A technical help app for all the family, developed in a six-person team over a mere three days, with the team working on site on the last day, TeamBuddy won 2nd prize in CI's May Hackathon.",
        "role": "My role: conception of original log-in logic; AI chat tuning; design and coding of the chat structure."
      },
      "shegitsit": {
        "name": "SheGitsIt",
        "hackathonName": "CodeHER: Empowering Women in Tech",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/58/",
        "siteURL": "",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/Carlos-n21/Team-4-SheCanGitIt",
        "desc": "An app designed to provide specialized support services for women in tech. Chief among its functions was an instant messaging service for female IT professionals to engage with their mentors. The project won third place in CI's March Hackathon.",
        "role": "My role: I designed and implemented the logic and structure of the messaging logic and completed the Django channels deployment setup."
      },
      "sparksync": {
        "name": "SparkSync",
        "hackathonName": "Love.exe - Coding connections in the digital age",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/56/",
        "siteURL": "",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/violaberg/dating-app",
        "technologies": "Django, Python, HTML5, CSS3, JavaScript, Heroku, Neon, Resend, Bootstrap, Django Channels, Daphne, Redis",
        "desc": "A dating app with an instant messaging component, SparkSync is one of the select list of Hackathon projects chosen by Code Institute for showcasing the output of its students. It also won 2nd prize in CI's February Hackathon",
        "role": "My role: I designed and implemented the logic and structure of the messaging logic and completed the Django channels deployment setup using Redis."
      },
      "co2nscious": {
        "name": "CO₂nscious",
        "hackathonName": "Battle of the Bootcamps",
        "hackathonDesc": "This was an extra short hackathon (over three days instead of the usual five) organized by Code Institute and two Berlin-based IT training institutions with the sponsorship of Doc Morris.",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/52/",
        "codebaseText": "GitHub repository",
        "codebaseURL": "https://github.com/raneem-yad/CO-nsious",
        "desc": "Climate-friendly action app. This project was developed over a mere three days, which turned out not to be enough time to create a working app.",
        "role": "My role: wireframes, Django models and Swagger APIs. I learned a lot in a very limited time about separating frontend and backend logic via code structure and clearly defined APIs and, perhaps above all, about using Git in a team environment."
      }
    }
  },
  "section4": {
    "title": "Major professional achievements",
    "projects": {
      "microbus-l10n": {
        "name": "Microbus (IVU suite) localization",
        "desc1": "When I joined <bold>IVU Traffic Technologies</bold> in 2004, I inherited responsibility for the localization (l10n) of a large and organically grown suite of software tools for public transport planning, scheduling, dispatch, and accounting. The suite was built over many years in C, C++, Java, and more, all communicating with a central <bold>Oracle</bold> DB, and all requiring ongoing UI and documentation l10n into 14 languages and dialects.",
        "desc2": "The l10n landscape faced some important challenges at the time:",
        "desc3": "Both in conjunction with my colleagues and on my own, I addressed these and other challenges through a mix of process redesign, tool integration, and software development:",
        "problems": [
          "Multiple UI resource formats and locations (Java resource files, JSON, XML, Excel, DB entries, Windows MFC dialogs)",
          "Conflicting (sometimes contradictory) legacy terminology",
          "Tracing code source of UI texts often difficult",
          "A large, labour-intensive HTML-based help system (generated from MS Word via Doc2Help)",
          "Numerous localized product variants requiring different locale combinations",
          "Inconsistent internationalization (i18n) in the codebase (hard-coded formats, unclear concatenations)",
          "New round of manual l10n required by each new build",
          "Patchy leverage of translation memory and terminology tools",
          "Locale-sensitive formats (currency, date, time) often mishandled",
          "Poor or non-existent locale-dependent formatting"
        ],
        "solutions": [
          "Introduced and enforced terminology management using <bold>Termstar</bold> and custom tools",
          "Consolidated and standardized the German glossary",
          "Replaced the Doc2Help workflow with <bold>Author-it</bold>, adopting a single-source model for help content",
          "Enabled customized documentation per locale or customer, greatly reducing “versioning hell”",
          "Used <bold>Passolo</bold> and <bold>Transit</bold> to streamline UI translation, ensuring no semantically identical strings needed translating twice",
          "Integrated Transit UI translation memory into documentation generation and l10n routines",
          "Integrated automatic software translation into newly introduced nightly build, using <bold>Maven/Ant</bold> and Passolo",
          "Worked closely with developers to improve and enforce i18n best practices",
          "Developed systems to detect and correct inconsistent terminology and poor i18n in code",
          "Adjusted UI sizing using <bold>MFC</bold> and <bold>Java Swing</bold> with Passolo"
        ]
      }
    }
  },
  "badges": {
    "may2025_2nd": "2nd Prize – May 2025 Hackathon",
    "march2025_3rd": "3rd Prize – March 2025 Hackathon",
    "march2025_people": "People's Choice – March 2025 Hackathon",
    "feb2025_2nd": "2nd Prize – February 2025 Hackathon"
  }
}
