{
  "title": "Los proyectos de Jaime",
  "projIntro": "Esta página lista varios de los proyectos en los que he estado involucrado recientemente. Los he dividido en tres secciones...",
  "section1": {
    "title": "Proyectos de Portafolio para mi certificación full-stack de Code Institute",
    "description": "Estos proyectos fueron originalmente creados de forma independiente como parte de mi curso de programación full-stack.",
    "projects": {
      "farming": {
        "name": "Farming Futures",
        "siteURL": "https://jaimehyland.github.io/farming-futures/",
        "codebaseText": "Repositorio GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/farming-futures",
        "desc": "Robótica en agricultura. Este es un sitio estático y responsivo bastante simple (desplegado en GitHub)."
      },
      "acento": {
        "name": "El acento español",
        "siteURL": "https://jaimehyland.github.io/elAcentoEspanyol/",
        "codebaseText": "Repositorio GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/farming-futures",
        "desc": "Explicador de la tilde española. Muestra el uso de un archivo de datos sencillo basado en JSON y contiene algo de lógica básica escrita en JS (desplegado en GitHub)."
      },
      "witch": {
        "name": "Witch-Hazel",
        "siteURL": "https://witch-hazel-5f8d8dfa45da.herokuapp.com/",
        "codebaseText": "Repositorio GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/elAcentoEspanyol",
        "desc": "Aplicación CLI para gestionar injertos en un vivero. Contiene lógica algo compleja implementada en una hoja de cálculo de Google mediante Python (desplegado en Heroku)."
      },
      "family": {
        "name": "Lista de compras familiar",
        "siteURL": "https://family-shopping-list-v1-bafe564ca613.herokuapp.com/",
        "codebaseText": "Repositorio GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/family_shopping_list_v1",
        "desc": "Aplicación de compras multiusuario en Django/PostgreSQL con mensajería instantánea usando Daphne y Django Channels junto con Redis (desplegado en Heroku)."
      },
      "mellifera": {
        "name": "Mellifera",
        "siteURL": "https://mellifera-e383ea0670a3.herokuapp.com/",
        "codebaseText": "Repositorio GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/mellifera",
        "desc": "Una tienda online (casi) funcional para apicultores con pagos a través de Stripe, desplegada en Heroku y usando AWS para archivos estáticos."
      }
    }
  },
  "section2": {
    "title": "Proyectos independientes en curso",
    "description": "Estos proyectos fueron creados de forma independiente por iniciativa propia; todos deben considerarse trabajo en curso.",
    "projects": {
      "portfolio": {
        "name": "Portfolio de Jaime Hyland",
        "siteURL": "https://jaime-hyland.com/",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/jaime-hyland-portfolio",
        "desc1": "Este proyecto es el sitio que estás viendo ahora mismo. Es un portafolio profesional y multilingüe desarrollado en <bold>TypeScript</bold> utilizando <bold>Next.js</bold>, <bold>Tailwind CSS</bold> y <bold>next-intl</bold>, diseñado para mostrar mi experiencia en localización de software, redacción técnica y desarrollo de software.",
        "desc2": "El sitio incluye:",
        "features": [
          "Un currículum estructurado e interactivo",
          "Un portafolio detallado de mis proyectos, con énfasis en los más recientes",
          "Compatibilidad <bold>i18n</bold> elegante y sin interrupciones, con localización en inglés, alemán y español",
          "Diseño limpio y accesible"
        ],
        "desc3": "Al desarrollarlo, he dado prioridad a la claridad sin complicaciones, la mantenibilidad, la capacidad de respuesta y la coherencia entre idiomas. Utiliza componentes <bold>React</bold> tipados con <bold>renderizado del lado del servidor</bold>, y refleja los mismos estándares que aplico en mi trabajo individual y en equipo. Es totalmente adaptable, optimizado para SEO y demuestra mi capacidad para construir plataformas de contenido robustas y escalables con herramientas modernas de frontend."
      },
      "pdf-merger": {
        "name": "Local PDF Merger",
        "siteURL": "https://pdf-merge-app-five.vercel.app/",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/pdf_merge_app/",
        "desc1": "Este proyecto está aún en una etapa muy temprana. Actualmente es simplemente una estructura mínima en Next.js para una rutina basada en pdf-lib (una biblioteca de TypeScript con componentes útiles para manejar archivos PDF). Aunque es primitiva, la aplicación funciona. Puedes probarla si quieres (usa la tecla shift o control para seleccionar más de un archivo PDF de tamaño moderado). Inspirado por algunas experiencias mixtas que tuve recientemente al intentar fusionar archivos PDF para mi búsqueda de empleo, y por el gran interés en la privacidad que tienen especialmente los consumidores alemanes, he decidido intentar crear una aplicación que fusione archivos PDF sin requerir que el usuario cargue sus archivos privados ni que tenga que descargar el archivo fusionado final.",
        "desc2": "La aplicación irá evolucionando con el tiempo. Puedes seguir mi progreso observando este espacio."
      },
      "shopify-prototype": {
        "name": "Prototipo de Shopify",
        "siteURL": "https://language-landscapes.myshopify.com/",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/JaimeHyland/shop-prototype/",
        "desc1": "Este proyecto también está en una etapa muy temprana. Hasta ahora, he conseguido lo siguiente:",
        "items": [
          "Creé una estructura inicial para una aplicación de Shopify con Node.js/Next.js usando la CLI de Shopify",
          "Creé una tienda básica y la conecté a la aplicación",
          "Configuré el archivo shopify.app.toml de la app para darle identidad y crear el vínculo con la tienda",
          "Preparé el entorno de desarrollo local con un túnel de Cloudflare",
          "Conecté la aplicación a un repositorio de GitHub para control de versiones y colaboración"
        ],
        "desc2": "Seguirá desarrollándose con el tiempo. Puedes seguir mi progreso echando un vistazo por aquí, y tal vez visitando mi tienda y el repositorio de vez en cuando."
      }
    }
  },
  "section3": {
    "title": "Proyectos de hackathon",
    "description1": "Estos proyectos colaborativos fueron desarrollados como parte de varios hackathons organizados por Code Institute desde finales de 2024. Cada hackathon reunió a un equipo de seis o siete personas que diseñaron, desarrollaron y documentaron una aplicación full-stack sobre un tema específico – con una sola excepción, en cinco días. Aunque reviso los proyectos de vez en cuando, no puedo garantizar que siempre funcionen correctamente.",
    "description2": "Como aprendí probablemente más durante cada semana de hackathon que en todo un mes de estudio, pienso seguir participando siempre que tenga la oportunidad. ¡Así que esta lista seguirá creciendo!",
    "CIHackathonsURL": "https://hackathon.codeinstitute.net/",
    "projects": {
      "techbuddy": {
        "name": "TechBuddy",
        "hackathonName": "Branching Out: A family hackathon",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/60/",
        "siteURL": "",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/apeskinian/tech_buddy",
        "desc": "Aplicación de ayuda técnica para toda la familia, desarrollada por un equipo de seis personas en tan solo tres días. El equipo trabajó de forma presencial el último día. TechBuddy obtuvo el segundo premio en el hackathon de mayo del CI.",
        "role": "Mi rol: concepción de la lógica de inicio de sesión; afinación del chat con IA; diseño y programación de la estructura del chat."
      },
      "shegitsit": {
        "name": "SheGitsIt",
        "hackathonName": "CodeHER: Empowering Women in Tech",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/58/",
        "siteURL": "",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/Carlos-n21/Team-4-SheCanGitIt",
        "desc": "Aplicación diseñada para ofrecer servicios de apoyo especializado a mujeres en tecnología. Su función principal era un sistema de mensajería instantánea para facilitar el contacto entre mentoras y profesionales IT. El proyecto ganó el tercer premio en el hackathon de marzo del CI.",
        "role": "Mi rol: diseñé e implementé la lógica y estructura del sistema de mensajería e hice la configuración de despliegue con Django Channels."
      },
      "sparksync": {
        "name": "SparkSync",
        "hackathonName": "Love.exe - Coding connections in the digital age",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/56/",
        "siteURL": "",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/violaberg/dating-app",
        "technologies": "Django, Python, HTML5, CSS3, JavaScript, Heroku, Neon, Resend, Bootstrap, Django Channels, Daphne, Redis",
        "desc": "Aplicación de citas con sistema de mensajería instantánea. SparkSync fue seleccionada por Code Institute como uno de los proyectos ejemplares para mostrar el trabajo de sus estudiantes. También obtuvo el segundo premio en el hackathon de febrero del CI.",
        "role": "Mi rol: diseñé e implementé la lógica y estructura del sistema de mensajería, y completé la configuración de despliegue con Django Channels usando Redis."
      },
      "co2nscious": {
        "name": "CO₂nscious",
        "hackathonName": "Battle of the Bootcamps",
        "hackathonDesc": "Hackathon corto (solo tres días en lugar de cinco), organizado por Code Institute y dos centros de formación en Berlín con el patrocinio de Doc Morris.",
        "hackathonURL": "https://hackathon.codeinstitute.net/hackathon/public/52/",
        "codebaseText": "Repositorio en GitHub",
        "codebaseURL": "https://github.com/raneem-yad/CO-nsious",
        "desc": "Aplicación para promover acciones respetuosas con el clima. El proyecto se desarrolló en apenas tres días, y no dio tiempo a completar una versión funcional.",
        "role": "Mi rol: wireframes, modelos Django y APIs con Swagger. Aprendí mucho en muy poco tiempo sobre la separación entre frontend y backend, estructuras limpias de código, y sobre todo, el uso de Git en equipo."
      }
    }
  },
  "section4": {
    "title": "Logros profesionales destacados",
    "projects": {
      "microbus-l10n": {
        "name": "Localización de Microbus (suite IVU)",
        "desc1": "Cuando me incorporé a <bold>IVU Traffic Technologies</bold> en 2004, asumí la responsabilidad de la localización (l10n) de una amplia suite de herramientas de software para planificación, programación, despacho y contabilidad del transporte público. Esta suite, desarrollada a lo largo de muchos años en C, C++, Java y otros lenguajes, se comunicaba con una base de datos central <bold>Oracle</bold> y requería una localización continua de la interfaz de usuario y la documentación en 14 idiomas y dialectos.",
        "desc2": "El panorama de la localización presentaba importantes retos en ese momento:",
        "desc3": "Tanto en colaboración con mis colegas como de forma independiente, abordé estos y otros desafíos mediante rediseño de procesos, integración de herramientas y desarrollo de software:",
        "problems": [
          "Múltiples formatos y ubicaciones de recursos de UI (archivos de recursos Java, JSON, XML, Excel, entradas en BD, diálogos MFC de Windows)",
          "Terminología heredada conflictiva o incluso contradictoria",
          "Difícil rastreo del origen de los textos de UI en el código",
          "Un sistema de ayuda HTML extenso y laborioso (generado desde MS Word con Doc2Help)",
          "Numerosas variantes de productos localizados con combinaciones diferentes de idiomas",
          "Internacionalización (i18n) inconsistente en el código (formatos codificados, concatenaciones poco claras)",
          "Cada compilación requería nueva ronda de localización manual",
          "Aprovechamiento limitado de herramientas de memoria de traducción y terminología",
          "Formatos sensibles al idioma (moneda, fecha, hora) mal gestionados",
          "Formatos dependientes del idioma ausentes o mal implementados"
        ],
        "solutions": [
          "Implementación y aplicación de gestión terminológica con <bold>Termstar</bold> y herramientas propias",
          "Consolidación y estandarización del glosario alemán",
          "Sustitución del flujo de trabajo Doc2Help por <bold>Author-it</bold>, adoptando modelo de fuente única",
          "Documentación personalizable por idioma o cliente – gran reducción del “infierno de versiones”",
          "Traducción de UI optimizada con <bold>Passolo</bold> y <bold>Transit</bold> – sin repetir traducciones de cadenas idénticas",
          "Integración de memoria de traducción de Transit en generación de documentación y procesos de l10n",
          "Traducción automática de software integrada en compilación nocturna (con <bold>Maven/Ant</bold> y Passolo)",
          "Colaboración estrecha con desarrolladores para mejorar y aplicar buenas prácticas de i18n",
          "Desarrollo de sistemas para detectar y corregir problemas terminológicos y de i18n en el código",
          "Ajuste de tamaños de UI con <bold>MFC</bold> y <bold>Java Swing</bold> usando Passolo"
        ]
      }
    }
  },
  "badges": {
    "may2025_2nd": "Segundo premio – Hackathon, mayo de 2015",
    "march2025_3rd": "Tercer premio – Hackathon, marzo de 2025",
    "march2025_people": "'People's Choice' – Hackathon, marzo de 2025",
    "feb2025_2nd": "Segundo premio – Hackathon, febrero de 2025"
  }
}
