{
  "homeInline": {
    "name": "Jaime Hyland",
    "tagline": "Desarrollador. Redactor. Formador.",
    "intro": "Soy un desarrollador full-stack con experiencia en lenguas y educación, y disfruto creando aplicaciones web limpias, atractivas y escalables que informan, educan, aumentan la productividad y mejoran la calidad de vida.",
    "techsTitle": "Algunas de las tecnologías con las que trabajo",
    "educationTitle": "Algunos de los lugares en los que me he formado",
    "buttonLabel": "¿Buscas un colaborador o desarrollador?",
    "buttonText": "Ponte en contacto"
  },
  "learningSection": {
    "heading": "Algunos de los lugares en los que me he formado",
    "FASTitle": "FÁS",
    "fasModalContent": "FÁS era la Autoridad Nacional Irlandesa de Formación Profesional en el momento en que realicé mi formación básica en Informática allí. Posteriormente fue reemplazada por <link>Solas</link>.",
    "trinityModalTitle": "Trinity College Dublin",
    "trinityModalContent": "Estudié Filosofía (o \"Ciencia Mental y Moral\", como todavía se llama el curso de grado) en el <link>Trinity College Dublin</link>. De 1984 a 1988, trabajé ampliamente en el campor de la filosofía de la lógica y las matemáticas.",
    "codeInstituteModalTitle": "Code Institute",
    "codeInstituteModalContent": "Realicé un curso en línea de <link>diplomado en desarrollo de software full-stack</link> en el prestigioso Code Institute, Dublín, desde 2023 hasta finales de 2024.\nEl curso puso se centraba en el lenguaje Python para la web moderna, aprovechando los frameworks Django y Bootstrap.\nMi proyecto final especializado fue un sitio de comercio electrónico, usando Stripe como su sistema de pago en línea.",
    "khanModalTitle": "Khan Academy",
    "khanModalContent": "<link>Khan Academy</link> es un recurso excelente para la formación en TI y la educación en matemáticas. Lo he utilizado hasta ahora para autoformación en teoría de ciencias de la computación, programación en JavaScript, estadística y cálculo.",
    "codefinityModalTitle": "Codefinity",
    "codefinityModalContent": "<link>Codefinity</link> es otro excelente recurso para la formación en TI. Hasta ahora, lo he usado para diversos materiales de aprendizaje, con un énfasis especial en Python.",
    "brilliantModalTitle": "Brilliant",
    "brilliantModalContent": "<link>Brilliant</link> es mi lugar de referencia cuando quiero tomar un descanso corto pero productivo. Lo he usado sobre todo para repasar mis matemáticas generales y para aprender un poco sobre circuitos eléctricos, que han sido un misterio para mí toda la vida.",
    "kodekloudModalTitle": "KodeKloud",
    "kodekloudModalContent": "He estado usando <link>KodeKloud</link> de forma intermitente para mejorar mi comprensión todavía bastante primitiva de Linux.\nEs un excelente proveedor de formación, sobre todo en DevOps.",
    "leetcodeModalTitle": "LeetCode",
    "leetcodeModalContent": "He estado usando <link>LeetCode</link> sobre todo para entender algunas de las preguntas comunes que podrían surgir al postularme para un trabajo como programador web full-stack.",
    "linkedinModalTitle": "LinkedIn Learning",
    "linkedinModalContent": "<link>LinkedIn Learning</link> ofrece una gran variedad de cursos en todas las disciplinas profesionales necesarias en el sector de la TI y otros campos.\nSe trata del resultado de la adquisición de Lynda.com, el famoso proveedor de formación en TI, por parte de LinkedIn.\nHasta ahora, lo he usado principalmente para familiarizarme con Dart/Flutter.",
    "freecodecampModalTitle": "freecodecamp",
    "freecodecampModalContent": "<link>freecodecamp</link> es mi proveedor original de muchas de mis habilidades básicas en desarrollo web.\nSu Currículo Certificado de Desarrollador Full Stack me ha resultado sumamente útil (aunque aún se encontraba en fase Beta en el momento en que escribí esto)."
  }
}